Catalogs/ЭтапыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭтапыПроцессов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоддержки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыВыполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеРезультата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПослеВыполнения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтрицательныйРезультат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяЭП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПростаяЭП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скрытый</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭтапыПроцессов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Не должно быть результатов с одинаковым представлением,
	// иначе это приведет к появлению кнопок с одинаковыми заголовками
	Для Каждого РезультатВыполнения Из РезультатыВыполнения Цикл
		
		Если РезультатыВыполнения.НайтиСтроки(Новый Структура("ПредставлениеРезультата",РезультатВыполнения.ПредставлениеРезультата)).Количество() > 1 Тогда
			
			ТекстСообщения = НСтр("ru='Не должно быть результатов выполнения с одинаковым представлением.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,"РезультатыВыполнения["+(РезультатВыполнения.НомерСтроки-1)+"].ПредставлениеРезультата",,Отказ);
			
			Прервать;
			
		КонецЕсли;
		
		Если РезультатыВыполнения.НайтиСтроки(Новый Структура("СтатусПослеВыполнения",РезультатВыполнения.СтатусПослеВыполнения)).Количество() > 1 Тогда
			
			ТекстСообщения = НСтр("ru='Не должно быть результатов выполнения, устанавливающих одинаковый статус.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,"РезультатыВыполнения["+(РезультатВыполнения.НомерСтроки-1)+"].СтатусПослеВыполнения",,Отказ);
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИдентификаторПоддержки = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
